<a href="https://colab.research.google.com/github/whart78/database_sql/blob/main/Copy_of_Database_and_SQL_Final_Project_Pt_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Database and SQL Final Project (Part 3)

##Name: 

**Make sure to "save" a copy of this file to your own account.**
**NOTE: Please include ALL of the parts of your final project (1, 2, and 3) for this submission, as this will be the last lab!**.

Exam 3 for the course will take the form of a “final project” where you will take a set of business rules (which you can find  below). and do the following.


1.	Formulate business rules
2.	Construct an ERD from a set of business rules
3.	Specify the relational schema
4.	Discuss whether this schema meets the 1N, 2N, and 3N normal forms
5.	Create the tables using SQL queries
6.	Run sample SQL queries that demonstrate your ability to
  
  a.	Create table with primary keys and multiple data types

  b.	Join tables with foreign keys

  c.	Insert sample data into tables

  d.	Update existing data in the table

  e.	Delete data from the table
7.	Run sample SQL queries that demonstrate your ability to do the following:

  a.	Simple single table queries

  b.	Single-table queries with WHERE and LIKE

  c.	Single-table queries with aggregate functions

  d.	Single table queries with GROUP BY

  e.	Single-table queries with HAVING

  f.	Subqueries

  g.	Simple multi-table queries with JOIN

  h.	More complex multi-table queries

  i.	The creation of table views
  
  j.	The creation of indexes
8.	Discuss your process of database design and implementation using the Software Development LifeCycle Model 
9.	Do something unique! You could do ONE of the following, or something else:

  a.	Build some indexes and analyze query performance

  b.	Figure out how to add a JSON column, and insert data

  c.	Write a PL/SQL functions or trigger and show how to use it

  d.	Expand the data model to include subtypes and supertypes

  e.	Let your creativity shine!
10.	Save this project as a portfolio-quality work to Github, which you can then share with me (and with future employers, if you would like).
The overall project is worth 100 points. We’ll be working on pieces of this for each of our “labs” from now until the end of the semester.


**Other Guidelines** Here are the guidelines for working on the project:

1. Each week, you should share your project with me to show me how you're doing. If you complete the required steps for that week, you'll receive full credit for the lab.
2. You are welcome to discuss your project with either me or your peers. However, your final work (for example, the ER diagram,  SQL code, etc.) should represent your *own* response. 
3. Each "step" in the lab will be worth ten points total (for a total of 100 points).

#Load Postgres (Run This Cell)

In [116]:
# Some UNIX utilites we need to install for the lab.
!pip install wget --quiet
!pip install sqlalchemy --quiet
!pip install ipython-sql --quiet

# Install postgresql server
!sudo apt-get -y -qq update
!sudo apt-get -y -qq install postgresql
!pip install pgspecial --quiet

!sudo service postgresql start


# Setup a password `postgres` for username `postgres`
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

# Setup a postgres database with name `my_data` to be used
!sudo -u postgres psql -U postgres -c 'DROP DATABASE IF EXISTS my_data;'

!sudo -u postgres psql -U postgres -c 'CREATE DATABASE my_data;'

# Postgres variables
%env DB_NAME=my_data
%env DB_HOST=localhost
%env DB_PORT=5432
%env DB_USER=postgres
%env DB_PASS=postgres

# Finally, let's make a connnection with the databse
%load_ext sql
%sql postgresql://$DB_USER:$DB_PASS@$DB_HOST/$DB_NAME

 * Starting PostgreSQL 10 database server
   ...done.
ALTER ROLE
ERROR:  database "my_data" is being accessed by other users
DETAIL:  There is 1 other session using the database.
ERROR:  database "my_data" already exists
env: DB_NAME=my_data
env: DB_HOST=localhost
env: DB_PORT=5432
env: DB_USER=postgres
env: DB_PASS=postgres
The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: postgres@my_data'

#Part 1: Scenario Analysis and Business Rule Formulation
For the project, you’ll be creating a mock database for “Monster University,” a school that takes young monsters (dragons, werewolves, cute “ET” style aliens, vampires, ogres, talking apes, robot assassins, and basically anything else you want) and teaches them to be upstanding members of the monster community. The professors are ALSO monsters. Here are the business rules you’ll need to get started:

1.	Your main goal is to represent the Monsters, Classes, and Locations (buildings/rooms) at the school.
2.	Monsters can either teach classes, take classes, or both.
3.	For all Monsters we need to keep track of their 

  a.	name

  b.	species (what kind of monster are they?)

  c.	date of birth

  d.	their diet, if known (herbivore, carnivore, omnivore, “brains”, “electricity”, etc.)

  e. their GPA (between 0 and 4.0)

  f. the number of credits completed.

4.	For classes, we’d like to track the following:

  a.	The title of the class

  b.	The location in which the class is held

  c.	The duration of the class in minutes (between 30 and 180)

  d.  The days on which the class meets (for example "MWF" or "TH").

  e.  The start time of the class 
  
  f.  The instructor of the class (who is a Monster)

  
5. For locations we want to record:

  a. A two-character building code (e.g., "MH" for Memorial Hall).

  b. The room number between 1 and 2000.

  c. The max capacity between 10 and 300.

6. Some Monsters are Alumni, who have graduated from the school. For alumni we also want to record:

  a. the year they graduated, and
  
  b. their degree (computer science, business, English, etc.).

7.	Formulate THREE additional business rules of your choice. Remember, you’ll eventually need to implement these! At least ONE of these rules should involve a new entity, relationship, and/or constraint (as opposed to simply a new attribute).

##Your New Business Rules Here:
1. item 1
Parents: Name Children in school, date of birth, species,
2. item 2
extracurriculars: What it is, number of members
3. item 3
Some locations are on campus and some are not

#Part 2: Conceptual Modeling using Entity-Relationship Diagramming
In this step, I'd like to create an ERD for the business rules above using [Diagrams.net](https://diagrams.net). You should include all entities, attributes, relationships, and cardinalilities. After you have completed this diagram, you should do the following:

1. Export it as "SVG" file in diagrams.net, and save this to your computer.
2. Edit this cell, and select the "Insert Image" button.
3. Select the SVG file you download.
4. NOTE: SVG files will work much better than larger image files (which may cause problems if you try to insert them).

INSERT SVG FILE HERE.![Lab10.drawio (1).svg]()

#Part 3: Logical Modeling
In this part, I'd like you to map the E-R model you've created to a relational model. This involves creating a relational scheme like the following:


```
table_name_1(attribute1 (PK), attribute2, attribute3)
table_name_2(attribute1 (PK), attribute2, attribute3)

```
You should indicate any **primary keys** by using (PK) and any foreign keys with (FK). For primary keys, you'll need to think about whether you can/should use attributes included in the ER diagram, or whether you might want to to create new attributes to serve as keys.

I recommend creating entities in this order:
1. One table for each "strong" entity in the E-R diagram. Decide on a primary key.
2. Tables for subtypes, if needed.
3. One table for each "weak" entity (besides subtypes) in the E-R diagram. Decide on appropriate primary and foreign keys.
4. Tables needed to model M:N relationships present in the E-R diagram.

**PUT YOUR ANSWER BELOW.**

My answer...
My answer... Monster(name(pk), date_of_birth, diet, GPA, credits_completed)- Role(teacher or student), Alumni(year_completed and degree)

(one to many)

Classes(class_title(pk),location, days_met,start_time,instructor)

(one to many)

Location(building_code(pk),room_number, max_capacity)-On or off(on_campus, off_campus)

#Part 4: Normalization
Are your relations normalized? Please provide a 2-3 sentence explanation of why/how they meet the following normal forms. Or, if they don't, describe what needs to be done to change them.

1. **First Normal Form.** 

(Your explantion here). These tables should already be in first normal form. Threre are no tables need to split into multiple values since there isn't any multiple values
2. **Second Normal Form.**
(Your explanation here). This should also be in second normal form. There are no partial dependencies on any attributes, as every attributes just describes the entry in question.
3. **Third Normal Form.** 
(Your explanation here). This should also be in third normal form. There are no transitive dependencies in any table, as nothing requires to be determined beforehand.

**Revised relational scheme (if needed):**
(Your answer here).

#Part 5: Creating Tables
In this part, you'll be creating the tables to store the data about your monstrous students. This involves "mapping" the relational schema to an actual Postgres Databases. Here's what you need to do:

1. CREATE a SQL table for each of the relations you identied in part 4.
2. Make sure all the attribututes are assigned appropriate data types. For example, INTEGER, VARCHAR, or DATE.
3.  Assign appropriate primary keys and foreign keys.

In the starter code below, I've assumed you'll have tables along the line of the following. However, you should feel free to rename, add, or delete tables as needed!

a. Monsters

b. Classes

c. Locations

d. Monsters2Classes

e. Alumni

In [117]:
%%sql 
--If you make mistakes you might need to drop tables and start again
--Here's one way of doing this (run this cell as needed)
DROP TABLE IF EXISTS Monsters CASCADE;
DROP TABLE IF EXISTS Classes CASCADE;
DROP TABLE IF EXISTS Locations CASCADE;
DROP TABLE IF EXISTS MonsterstoClasses CASCADE;
DROP TABLE IF EXISTS Alumni CASCADE;
DROP TABLE IF EXISTS Parents CASCADE;
DROP TABLE IF EXISTS Extracurriculars CASCADE;

 * postgresql://postgres:***@localhost/my_data
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [118]:
%%sql
--Here's the start of one create table statement
--You'll need to create each table individually
--You also need some contraints here!

CREATE TABLE Monsters(
  id INTEGER PRIMARY KEY,
  name VARCHAR(26),
  dob DATE,
  species VARCHAR(10),
  diet VARCHAR(15),
  gpa NUMERIC(3,2),
  role VARCHAR(7),
  credits INTEGER,
  extracurricular VARCHAR(15)
);

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [119]:
%%sql

--Create another table, if needed
CREATE TABLE Classes(
  class_id INTEGER PRIMARY KEY,
  title VARCHAR(26),
  location VARCHAR(6),
  duration VARCHAR(10),
  days VARCHAR(5),
  start_time VARCHAR(12),
  instructor VARCHAR(26)
);

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [120]:
%%sql 
--Create another table, if needed
CREATE TABLE Locations(
  code VARCHAR(2),
  room_num INTEGER,
  max_cap INTEGER ,
  campus VARCHAR(3)
  );

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [121]:
%%sql 
--Create another table, if needed
CREATE TABLE Alumni(
  name VARCHAR(26),
  graduation_year INTEGER,
  degree VARCHAR(26) 
);

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [122]:
%%sql
--Create another table, if needed
CREATE TABLE MonsterstoClasses(
  name VARCHAR(26),
  class VARCHAR(26)
);

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [123]:
%%sql
CREATE TABLE  Extracurriculars(
  activity_id INTEGER PRIMARY KEY,
  name VARCHAR(26),
  num_of_members VARCHAR(2)
)

 * postgresql://postgres:***@localhost/my_data
Done.

[]

#Part 6: Retrieving, Updating, and Deleting Data
In this part, you'll be inserting some data about Monsters, Classes, and Locations.

##6b. Inserting Data
Here are five monsters to insert your database:

1. Cookie Monster (unknown species) was born on Nov 10, 1969. His eats only cookies. He has 3.2 GPA and has completed 76 credits.
2. Marceline (vampire) was born in Feb 3, 1056. She eats "the color red". She is a teacher with a 0.0 GPA and 0 credits completed.
3. Chewbacca (wookie) was born on May 25, 1977. He is an omnivore. He has a 2.6 GPA and has completed 24 credits.
4. Dracula (vampire) was born on Aug 15, 1543. He drinks blood. He has a 4.0 GPA with 112 credits completed. He also teachers classes.
5. Maleficient (dragon) was born on Oct 26, 1856. She is a carnviore. She has a 3.8 GPA with 63 credits completed.
6. Insert at least FOUR more monsters of your choice. At least two of these should have the same species.

Now, show the data in the table.

Here are three locations to insert into your database:
1. CL 101 ("Castle level 1, room 1") holds 100 people.
2. CL 503 ("Castle level 5, room 3") holds 34 people.
3. MU 220 ("Monster Union room 220") holds 12 people.
4. Insert at least TWO more locations into your database. Both should be in the same building. 

Now, show the data in the table.


Here are two classes to insert into your database:
1. Marceline teaches Intro to Guitar on TH from 2 PM to 4 PM in MU 220.
2. Dracula teaches Monster First Aid on MWF from 9 PM to 10 PM in CL 503.
2. Insert at least ONE more class.

Now, show the data in the table.


"ENROLL" some students in your classes.
1. Cookie Monster, Chewbacca, and Maleficient (and perhaps some of the students you added) will take Monster First Aid.
2. Chewbacca and Malificient (and perhaps some of the students you added) will take Intro to Guitar.
3. Enroll some students in your own class!
Now, show the data in the table.


Finally, insert data for at least ONE alumni, and show the results.

In [124]:
%%sql 
-- If you make mistakes, you might need to delete existing data from your tables. 
-- One way you might do this is as follows
-- You might need to include different table names!

DELETE FROM Monsters CASCADE;
DELETE FROM Locations CASCADE;
DELETE FROM Classes CASCADE;
DELETE FROM Alumni CASCADE;
DELETE FROM MonsterstoClasses CASCADE;
DELETE FROM Extracurriculars CASCADE;

 * postgresql://postgres:***@localhost/my_data
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [125]:
%%sql
--- Insert the data on Monsters. You'll be using statements like the following:
--INSERT INTO Monsters(id, name, ...) VALUES (1, 'Cookie Monster', ...);

--When you are done inserting, you should display the data, like so:
--SELECT * FROM Monsters;

INSERT INTO Monsters(id, name, dob, species, diet, GPA, credits, role, extracurricular)
 VALUES(505, 'Cookie Monster', '1969-11-10', NULL, 'Cookies', 3.2, 76, 'student', 'Cookie Club'),
 (506, 'Marceline', '1056-02-03', 'Vampire', 'the color red', 0.0, 0, 'teacher', NULL),
 (507, 'Chewbacca', '1977-05-25', 'Wookie', 'Omnivore', 2.6, 24, 'student', 'Football'),
 (508, 'Maleficient', '1856-10-26', 'Dragon', 'Carnivore', 3.8, 63, 'student', 'Football'),
 (509, 'Dracula', '1543-08-15', 'Vampire', 'blood', 4.0, 112, 'both', 'Basketball'),
 (510, 'Frankenstein', '1818-01-01', 'Undead', 'Omnivore', 4.0, 30, 'teacher', NULL),
 (511, 'Tarfful', '1988-05-16', 'Wookie', 'Omnivore', 2.7, 27, 'student', 'Baseball'),
 (512, 'Sully', '2001-08-17', NULL, 'Carnivore', 3.5, 56, 'both', 'Wrestling'),
 (513, 'Polyphemus', '1000-01-01', 'Cyclops', 'Carnivore', 0.0, 0, 'teacher', NULL);

 * postgresql://postgres:***@localhost/my_data
9 rows affected.

[]

In [126]:
%%sql
SELECT * FROM Monsters;

 * postgresql://postgres:***@localhost/my_data
9 rows affected.

[(505, 'Cookie Monster', datetime.date(1969, 11, 10), None, 'Cookies', Decimal('3.20'), 'student', 76, 'Cookie Club'),
 (506, 'Marceline', datetime.date(1056, 2, 3), 'Vampire', 'the color red', Decimal('0.00'), 'teacher', 0, None),
 (507, 'Chewbacca', datetime.date(1977, 5, 25), 'Wookie', 'Omnivore', Decimal('2.60'), 'student', 24, 'Football'),
 (508, 'Maleficient', datetime.date(1856, 10, 26), 'Dragon', 'Carnivore', Decimal('3.80'), 'student', 63, 'Football'),
 (509, 'Dracula', datetime.date(1543, 8, 15), 'Vampire', 'blood', Decimal('4.00'), 'both', 112, 'Basketball'),
 (510, 'Frankenstein', datetime.date(1818, 1, 1), 'Undead', 'Omnivore', Decimal('4.00'), 'teacher', 30, None),
 (511, 'Tarfful', datetime.date(1988, 5, 16), 'Wookie', 'Omnivore', Decimal('2.70'), 'student', 27, 'Baseball'),
 (512, 'Sully', datetime.date(2001, 8, 17), None, 'Carnivore', Decimal('3.50'), 'both', 56, 'Wrestling'),
 (513, 'Polyphemus', datetime.date(1000, 1, 1), 'Cyclops', 'Carnivore', Decimal('0.00'), 'teacher', 0, None)]

In [127]:
%%sql
--Insert the data on locations, and show the results
INSERT INTO Classes(class_id, title, location, duration, days, start_time, instructor)
 VALUES(1, 'Intro to Guitar', 'MU 220', '2 hours', 'TH', '2pm', 'Marceline'),
 (2, 'Monster First Aid', 'OU 200', '1 hour', 'MWF', '9pm', 'Dracula'),
 (3, 'Weight Lifting', 'MU 100', '1 hour', 'TF', '6am', 'Polyphemus');

 * postgresql://postgres:***@localhost/my_data
3 rows affected.

[]

In [128]:
%%sql
SELECT * FROM Classes;

 * postgresql://postgres:***@localhost/my_data
3 rows affected.

[(1, 'Intro to Guitar', 'MU 220', '2 hours', 'TH', '2pm', 'Marceline'),
 (2, 'Monster First Aid', 'OU 200', '1 hour', 'MWF', '9pm', 'Dracula'),
 (3, 'Weight Lifting', 'MU 100', '1 hour', 'TF', '6am', 'Polyphemus')]

In [129]:
%%sql
--Insert the data on classes, and show the results
INSERT INTO Locations(code, room_num, max_cap, campus)
 VALUES('CL', 101, 100, 'yes'),
 ('CL', 503, 34, 'yes'),
 ('MU', 220, 12, 'yes'),
 ('SH', 120, 15, 'no'),
 ('SH', 100, 25, 'no');

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[]

In [130]:
%%sql
SELECT * FROM Locations;

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('CL', 101, 100, 'yes'),
 ('CL', 503, 34, 'yes'),
 ('MU', 220, 12, 'yes'),
 ('SH', 120, 15, 'no'),
 ('SH', 100, 25, 'no')]

In [131]:
%%sql
--Insert the alumni data, and show the results
INSERT INTO Alumni(name, graduation_year, degree)
 VALUES('Godzilla', 1988, 'Destruction'),
 ('King Kong', 1988, 'Destruction'),
 ('Thanos', 2016, 'Philosophy'),
 ('Casper', 2000, 'Social Work')

 * postgresql://postgres:***@localhost/my_data
4 rows affected.

[]

In [132]:
%%sql
SELECT * FROM Alumni

 * postgresql://postgres:***@localhost/my_data
4 rows affected.

[('Godzilla', 1988, 'Destruction'),
 ('King Kong', 1988, 'Destruction'),
 ('Thanos', 2016, 'Philosophy'),
 ('Casper', 2000, 'Social Work')]

In [133]:
%%sql
--Insert the enrollment data, and show the results
INSERT INTO MonsterstoClasses( name, class)
 VALUES( 'Cookie Monster', 'Monster First Aid'),
 ( 'Chewbacca','Monster First Aid'),
 ('Chewbacca', 'Intro to Guitar'),
 ( 'Dracula', 'Monster First Aid'),
 ( 'Maleficient', 'Monster First Aid'),
 ( 'Maleficient', 'Intro to Guitar'),
 ( 'Sully', 'Weight Lifting');

 * postgresql://postgres:***@localhost/my_data
7 rows affected.

[]

In [134]:
%%sql
SELECT * FROM MonsterstoClasses;

 * postgresql://postgres:***@localhost/my_data
7 rows affected.

[('Cookie Monster', 'Monster First Aid'),
 ('Chewbacca', 'Monster First Aid'),
 ('Chewbacca', 'Intro to Guitar'),
 ('Dracula', 'Monster First Aid'),
 ('Maleficient', 'Monster First Aid'),
 ('Maleficient', 'Intro to Guitar'),
 ('Sully', 'Weight Lifting')]

In [135]:
%%sql
INSERT INTO Extracurriculars(activity_id, name, num_of_members)
 VALUES(60, 'Football', '30'),
 (61, 'Cookie Club', '1'),
 (62, 'Basketball', '13'),
 (63, 'Baseball', '30'),
 (64, 'Wrestling', '60'),
 (65, 'Student Government', '10'),
 (66, 'Debate', '5'),
 (67, 'Bread Club', '6');

 * postgresql://postgres:***@localhost/my_data
8 rows affected.

[]

In [136]:
%%sql
SELECT * FROM Extracurriculars

 * postgresql://postgres:***@localhost/my_data
8 rows affected.

[(60, 'Football', '30'),
 (61, 'Cookie Club', '1'),
 (62, 'Basketball', '13'),
 (63, 'Baseball', '30'),
 (64, 'Wrestling', '60'),
 (65, 'Student Government', '10'),
 (66, 'Debate', '5'),
 (67, 'Bread Club', '6')]

#6c: Updating Data
In this section, I'd like you to run the following updates

1. MU 220 has been expanded! It can now hold 25 students, instead of 12.
2. Another semester has passed. Add 12 credits to each student's record.
3. [Another update of your choice--describe here.]

After each update please SELECT from the table to show the results.

In [137]:
%%sql
--Update MU 220 and show results
UPDATE Locations
SET max_cap = 25
WHERE room_num = 220

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[]

In [138]:
%%sql
SELECT * FROM Locations;

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('CL', 101, 100, 'yes'),
 ('CL', 503, 34, 'yes'),
 ('SH', 120, 15, 'no'),
 ('SH', 100, 25, 'no'),
 ('MU', 220, 25, 'yes')]

In [139]:
%%sql 
--Update student credits and show results
UPDATE Monsters
SET credits = credits + 12
WHERE role NOT LIKE '%teacher%'

 * postgresql://postgres:***@localhost/my_data
6 rows affected.

[]

In [140]:
%%sql
SELECT * FROM Monsters;

 * postgresql://postgres:***@localhost/my_data
9 rows affected.

[(506, 'Marceline', datetime.date(1056, 2, 3), 'Vampire', 'the color red', Decimal('0.00'), 'teacher', 0, None),
 (510, 'Frankenstein', datetime.date(1818, 1, 1), 'Undead', 'Omnivore', Decimal('4.00'), 'teacher', 30, None),
 (513, 'Polyphemus', datetime.date(1000, 1, 1), 'Cyclops', 'Carnivore', Decimal('0.00'), 'teacher', 0, None),
 (505, 'Cookie Monster', datetime.date(1969, 11, 10), None, 'Cookies', Decimal('3.20'), 'student', 88, 'Cookie Club'),
 (507, 'Chewbacca', datetime.date(1977, 5, 25), 'Wookie', 'Omnivore', Decimal('2.60'), 'student', 36, 'Football'),
 (508, 'Maleficient', datetime.date(1856, 10, 26), 'Dragon', 'Carnivore', Decimal('3.80'), 'student', 75, 'Football'),
 (509, 'Dracula', datetime.date(1543, 8, 15), 'Vampire', 'blood', Decimal('4.00'), 'both', 124, 'Basketball'),
 (511, 'Tarfful', datetime.date(1988, 5, 16), 'Wookie', 'Omnivore', Decimal('2.70'), 'student', 39, 'Baseball'),
 (512, 'Sully', datetime.date(2001, 8, 17), None, 'Carnivore', Decimal('3.50'), 'both', 68, 'Wrestling')]

In [141]:
%%sql 
--An update of your choice and show the results
UPDATE Monsters
SET GPA = 3.0
WHERE id = 512

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[]

In [142]:
%%sql
SELECT * FROM Monsters;

 * postgresql://postgres:***@localhost/my_data
9 rows affected.

[(506, 'Marceline', datetime.date(1056, 2, 3), 'Vampire', 'the color red', Decimal('0.00'), 'teacher', 0, None),
 (510, 'Frankenstein', datetime.date(1818, 1, 1), 'Undead', 'Omnivore', Decimal('4.00'), 'teacher', 30, None),
 (513, 'Polyphemus', datetime.date(1000, 1, 1), 'Cyclops', 'Carnivore', Decimal('0.00'), 'teacher', 0, None),
 (505, 'Cookie Monster', datetime.date(1969, 11, 10), None, 'Cookies', Decimal('3.20'), 'student', 88, 'Cookie Club'),
 (507, 'Chewbacca', datetime.date(1977, 5, 25), 'Wookie', 'Omnivore', Decimal('2.60'), 'student', 36, 'Football'),
 (508, 'Maleficient', datetime.date(1856, 10, 26), 'Dragon', 'Carnivore', Decimal('3.80'), 'student', 75, 'Football'),
 (509, 'Dracula', datetime.date(1543, 8, 15), 'Vampire', 'blood', Decimal('4.00'), 'both', 124, 'Basketball'),
 (511, 'Tarfful', datetime.date(1988, 5, 16), 'Wookie', 'Omnivore', Decimal('2.70'), 'student', 39, 'Baseball'),
 (512, 'Sully', datetime.date(2001, 8, 17), None, 'Carnivore', Decimal('3.00'), 'both', 68, 'Wrestling')]

#Part 7: SQL Queries
In this section, you'll be demonstrating your ability to retrieve data from the database you've created using SQL queries.

##7a: Simple Single table queries
Retreive a list of monsters ordered alphabetically by name. Limit your results to 5.

In [143]:
%%sql
-- 7a
SELECT name FROM Monsters
ORDER BY name ASC
LIMIT 5;

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Chewbacca',),
 ('Cookie Monster',),
 ('Dracula',),
 ('Frankenstein',),
 ('Maleficient',)]

##7b. Single-table queries with WHERE and LIKE
Retrieve JUST the classes that meet on Wednesday (where Wednesday is the 'W' in strings like 'MWF').

In [144]:
%%sql
-- 7b
SELECT * FROM Classes
WHERE days LIKE '%W%'

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[(2, 'Monster First Aid', 'OU 200', '1 hour', 'MWF', '9pm', 'Dracula')]

##7c. Single-table queries with aggregate functions
Retrieve the minimum, maximum, and average GPA included in your database. You should label the columns "Min GPA", "Max GPA", and "Avg GPA".

In [145]:
%%sql 
--7c
SELECT MAX(GPA) AS "Max GPA",  MIN(GPA) AS "Min GPA",  AVG(GPA) AS "Avg GPA"
FROM Monsters

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[(Decimal('4.00'), Decimal('0.00'), Decimal('2.5888888888888889'))]

##7d. Single table queries with GROUP BY
Retrieve a list of each monster species included in the database, along with a count of how many monsters are members of the species.

In [146]:
%%sql
--7d
SELECT COUNT(species), species FROM Monsters
GROUP BY species

 * postgresql://postgres:***@localhost/my_data
6 rows affected.

[(0, None),
 (2, 'Vampire'),
 (1, 'Dragon'),
 (1, 'Cyclops'),
 (2, 'Wookie'),
 (1, 'Undead')]

##7e. Single-table queries with HAVING
Retrieve a list of the buildings (not rooms!) in your data that have a total capacity of more than 20. (A building's capacity is simply the sum of the capacities of all the classrooms it contains).

In [147]:
%%sql
--7e
SELECT max_cap
FROM Locations
GROUP BY max_cap
HAVING max_cap > 20

 * postgresql://postgres:***@localhost/my_data
3 rows affected.

[(34,), (100,), (25,)]

##7f. Subqueries
Retrieve a list of monsters names and species, together with a count of how many members of that species are in the database.

In [148]:
%%sql
-- 7f
SELECT COUNT(species), species, name FROM Monsters
GROUP BY species, NAME

 * postgresql://postgres:***@localhost/my_data
9 rows affected.

[(1, 'Wookie', 'Tarfful'),
 (1, 'Cyclops', 'Polyphemus'),
 (0, None, 'Cookie Monster'),
 (0, None, 'Sully'),
 (1, 'Vampire', 'Dracula'),
 (1, 'Dragon', 'Maleficient'),
 (1, 'Vampire', 'Marceline'),
 (1, 'Wookie', 'Chewbacca'),
 (1, 'Undead', 'Frankenstein')]

#7g. Simple multi-table queries with JOIN
Retrieve the names and GPAs of students enrolled in Intro to Guitar.

In [149]:
%%sql
-- 7g
SELECT Monsters.name, Monsters.gpa from Monsters
FULL OUTER JOIN MonsterstoClasses
ON Monsters.name = MonsterstoClasses.name
WHERE class LIKE '%Intro to Guitar%'

 * postgresql://postgres:***@localhost/my_data
2 rows affected.

[('Chewbacca', Decimal('2.60')), ('Maleficient', Decimal('3.80'))]

##7h. More complex multi-table queries
Retrieve the total students taught by each teacher in the database. You should have one row of output for each teacher with their name and the total number of students.

In [150]:
%%sql
DROP TABLE IF EXISTS Teachers CASCADE;

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [151]:
%%sql 
CREATE TABLE Teachers(
  teacher_id INTEGER PRIMARY KEY,
  num_students INTEGER
  )

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [152]:
%%sql
DELETE FROM Teachers CASCADE;

 * postgresql://postgres:***@localhost/my_data
0 rows affected.

[]

In [153]:
%%sql
INSERT INTO Teachers(teacher_id, num_students)
  VALUES(506, 100),
  (510, 200),
  (513, 500),
  (509, 50),
  (512, 20)

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[]

In [154]:
%%sql
SELECT * FROM Teachers

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[(506, 100), (510, 200), (513, 500), (509, 50), (512, 20)]

In [155]:
%%sql 
-- 7h
SELECT Teachers.teacher_id, Teachers.num_students, Monsters.name, Monsters.id
FROM Teachers
FULL OUTER JOIN Monsters ON Teachers.teacher_id = Monsters.id
ORDER BY teacher_id ASC

 * postgresql://postgres:***@localhost/my_data
9 rows affected.

[(506, 100, 'Marceline', 506),
 (509, 50, 'Dracula', 509),
 (510, 200, 'Frankenstein', 510),
 (512, 20, 'Sully', 512),
 (513, 500, 'Polyphemus', 513),
 (None, None, 'Maleficient', 508),
 (None, None, 'Cookie Monster', 505),
 (None, None, 'Chewbacca', 507),
 (None, None, 'Tarfful', 511)]

##7i. Creation of Views
Create a VIEW based on a SQL query of your choice. Now "SELECT *" from this view to show the results.

In [156]:
%%sql
-- 7i
CREATE VIEW DaMonsters AS
SELECT name, diet, species
FROM Monsters
ORDER BY name DESC

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [157]:
%%sql
SELECT * FROM DaMonsters

 * postgresql://postgres:***@localhost/my_data
9 rows affected.

[('Tarfful', 'Omnivore', 'Wookie'),
 ('Sully', 'Carnivore', None),
 ('Polyphemus', 'Carnivore', 'Cyclops'),
 ('Marceline', 'the color red', 'Vampire'),
 ('Maleficient', 'Carnivore', 'Dragon'),
 ('Frankenstein', 'Omnivore', 'Undead'),
 ('Dracula', 'blood', 'Vampire'),
 ('Cookie Monster', 'Cookies', None),
 ('Chewbacca', 'Omnivore', 'Wookie')]

##7g. Creation of Indexes.
Create an index on the column that contains the Monster's names.

In [158]:
%%sql
-- 7f
CREATE INDEX idx_name
ON Monsters(name)

 * postgresql://postgres:***@localhost/my_data
Done.

[]

#8. Database Design Philosophy
In 150 to 200 words, answer the question **"What are the keys to designing a successful database, and how is this reflected in your own work here?"**

YOUR ANSWER HERE.

The keys to designing a successful database is consider different viewpoints when planning, make the data and structures easy to understand, and finally make table integrity strong. The planning section of a database may be the most important part of the database, as you can eliminate a lot of issues up front good planning, in the form of mapping out data structures, planning tables and values in them, and forming relationships. I did this in section one of the lab, and though it wasn't perfect, it defintely helped during the later parts of the lab to make the product I have. Making the data and structures easy to understand is simple but overlooked at of the time. It is very important when creating databases that will be published and edited. I do this by making columns and values that fit well into the existing one, as well as making variable names that are easy to understand. Finally, there is table integrity. It is important to cut down on data redundancy since it will lead to querys not working due to unwanted data. I do this by making one key in each table that is easy to join with tables it will join with a lot, as well as making it simple to join with tables it won't normally join with.

#9. Be Creative!
In 150 to 200 words, tell me about what you've done (or will do, in this section) that goes above and beyond the "requirements" of the assignment. Why did you choose to do this? What did you learn from doing it?

YOUR ANSWER HERE.

(Feel free to add code cells below if needed.)

I thought it would be cool to make a locker system in the database for all the students. Some of the main reasons I think this is cool is that it helps work on the core concepts of table creation, value insertion, and updating of values. The insertion and updating part is really key here since the whole thing with the locker table is that students are always adding and taking things to and from their lockers. This goes above and beyond because it was not required in the assignment, but is a great addition in my eyes. I mostly learned more about how insertion and updating values work when thinking and applying these concept of lockers, and I actually had a lot of fun coding it, since these monsters can have some pretty weird stuff in their lockers. Though I didn't go too indepth with the whole updating portion, the potential is there to create some really funny stuff with Monster High's student body, and the code is open to updates, and fine tuning that will only get better with more students.

In [159]:
%%sql
DROP TABLE IF EXISTS Lockers CASCADE;

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [160]:
%%sql
CREATE TABLE Lockers(
  locker_num INTEGER PRIMARY KEY,
  owner VARCHAR(26),
  magic VARCHAR(26),
  item1 VARCHAR(26),
  item2 VARCHAR(26),
  item3 VARCHAR(26),
  item4 VARCHAR(26)
)

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [161]:
%%sql
DELETE FROM Lockers CASCADE;

 * postgresql://postgres:***@localhost/my_data
0 rows affected.

[]

In [162]:
%%sql
-- Include code, if needed.
INSERT INTO Lockers(locker_num, owner, magic, item1, item2, item3, item4)
  VALUES(256, 'Sully', 'Portals', 'Football Helmet', 'Monsters Inc Hat', 'Scary Books', NULL),
  (258, 'Chewbacca', 'The Force', 'Bowcaster', 'Utility Belt', 'Falcon Keys', 'Jungle Snacks'),
  (350, 'Dracula', 'Bat Summon', 'Blood', 'More Blood', 'Even More Blood', 'Twilight Series'),
  (102, 'Tarfful', NULL, 'Bowcaster', 'Fur Comb', 'Wookie Book', 'Protein Powder'),
  (106, 'Cookie Monster', NULL, 'Cookie Jar', 'Cookie Cook Book', 'Cookie Club Hat', 'Backup Cookies'),
  (400, 'Maleficient', 'Form-Shift', 'Hellfire', 'Evil Laughter Book', NUll, NUll )

 * postgresql://postgres:***@localhost/my_data
6 rows affected.

[]

In [163]:
%%sql
SELECT * FROM Lockers
ORDER BY locker_num ASC

 * postgresql://postgres:***@localhost/my_data
6 rows affected.

[(102, 'Tarfful', None, 'Bowcaster', 'Fur Comb', 'Wookie Book', 'Protein Powder'),
 (106, 'Cookie Monster', None, 'Cookie Jar', 'Cookie Cook Book', 'Cookie Club Hat', 'Backup Cookies'),
 (256, 'Sully', 'Portals', 'Football Helmet', 'Monsters Inc Hat', 'Scary Books', None),
 (258, 'Chewbacca', 'The Force', 'Bowcaster', 'Utility Belt', 'Falcon Keys', 'Jungle Snacks'),
 (350, 'Dracula', 'Bat Summon', 'Blood', 'More Blood', 'Even More Blood', 'Twilight Series'),
 (400, 'Maleficient', 'Form-Shift', 'Hellfire', 'Evil Laughter Book', None, None)]

In [164]:
%%sql
UPDATE Lockers
SET item3 = 'Comedy Books'
WHERE locker_num = 256;

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[]

In [165]:
%%sql
SELECT * FROM Lockers
ORDER BY locker_num ASC

 * postgresql://postgres:***@localhost/my_data
6 rows affected.

[(102, 'Tarfful', None, 'Bowcaster', 'Fur Comb', 'Wookie Book', 'Protein Powder'),
 (106, 'Cookie Monster', None, 'Cookie Jar', 'Cookie Cook Book', 'Cookie Club Hat', 'Backup Cookies'),
 (256, 'Sully', 'Portals', 'Football Helmet', 'Monsters Inc Hat', 'Comedy Books', None),
 (258, 'Chewbacca', 'The Force', 'Bowcaster', 'Utility Belt', 'Falcon Keys', 'Jungle Snacks'),
 (350, 'Dracula', 'Bat Summon', 'Blood', 'More Blood', 'Even More Blood', 'Twilight Series'),
 (400, 'Maleficient', 'Form-Shift', 'Hellfire', 'Evil Laughter Book', None, None)]

#10. Share Work With Me on Github
Finally, I'd like you to share your work with me on Github. If you are interesting in working in computer science or IT, it's good to have a basic understanding of how Github works, as its something like an industry "standard" way of sharing code. 
 
Here's what you need to do:
1. Create an account on https://github.com/ 
2. Create a PUBLIC repository called "database_sql".
3. Save your **completed** lab to this repository. From colab, all you need to do is go to "File: Save a copy in Github."

An in-depth tutorial on using Github is here:
https://docs.github.com/en/get-started/quickstart/hello-world 
The only things you need to worry about are (a) creating an account and (b) creating a repository. We won't be worry about branches, commits, or pulls (though you are free to read up on these!). 

Once you've done this, please write down your:

USERNAME: whart78

REPOSITORY LINK: https://github.com/whart78/database_sql 

And that's it! I've enjoyed having you in class--enjoy the rest of the semster :).

**You should also submit this to the D2L Assignment folder.**